pafgoncalves/ArduinoSimulator/ArduinoSimulatorWeb/src/main/resources/arduino_package/boards.txt


unosim.name=Arduino Uno Simulator

unosim.vid.0=0x2341
unosim.pid.0=0x0043
unosim.vid.1=0x2341
unosim.pid.1=0x0001
unosim.vid.2=0x2A03
unosim.pid.2=0x0043
unosim.vid.3=0x2341
unosim.pid.3=0x0243


unosim.upload.tool=simupload
unosim.upload.protocol=arduino
unosim.upload.maximum_size=32256
unosim.upload.maximum_data_size=2048
unosim.upload.speed=115200

#unosim.bootloader.tool=simupload
#unosim.bootloader.low_fuses=0xFF
#unosim.bootloader.high_fuses=0xDE
#unosim.bootloader.extended_fuses=0xFD
#unosim.bootloader.unlock_bits=0x3F
#unosim.bootloader.lock_bits=0x0F
#unosim.bootloader.file=optiboot/optiboot_atmega328.hex

unosim.build.mcu=atmega328p
unosim.build.f_cpu=16000000L
unosim.build.board=AVR_UNO
unosim.build.core=arduino:arduino
unosim.build.variant=arduino:standard





